Revit 2026 API

# RevitLinkOperations Methods

---

The RevitLinkOperations type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from LinkOperations) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetGetLocalPathForOpenCallback | Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer. |
|  | SetOnLocalLinkSharedCoordinatesSavedCallback | Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer. (Inherited from LinkOperations) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RevitLinkOperations Class

Autodesk.Revit.DB Namespace